Revit 2027 API
Rebar.ScheduleMark Property
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ScheduleMark { get; set; }
Public Property ScheduleMark As String
	Get
	Set
public:
property String^ ScheduleMark {
	String^ get ();
	void set (String^ value);
}
member ScheduleMark : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace